In [2]:
import pandas as pd
import numpy as np

# Group By in Python

* **groupby() splits the data into groups based on column values.
Then it applies a function (like sum, mean, count) to each group separately.**

ðŸ”¹ Task:
**Group the data by 'Department' and calculate the average salary for each department.**

In [ ]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Salary': [50000, 52000, 70000, 72000, 60000, 61000]
    }
df = pd.DataFrame(data)
df

  Department Employee  Salary
0         HR    Alice   50000
1         HR      Bob   52000
2         IT  Charlie   70000
3         IT    David   72000
4    Finance      Eve   60000
5    Finance    Frank   61000

In [5]:
df.groupby('Department')['Salary'].mean()

Department
Finance    60500.0
HR         51000.0
IT         71000.0
Name: Salary, dtype: float64

ðŸ”¹ Task:
**Group the data by 'Department' and calculate the total salary (sum) in each department.**

In [6]:
df.groupby('Department')['Salary'].sum()

Department
Finance    121000
HR         102000
IT         142000
Name: Salary, dtype: int64

In [ ]:
data = {'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Sales': [200, 250, 400, 420, 150, 180],
    'Discount': [20, 25, 40, 50, 15, 18]}
df_sales = pd.DataFrame(data)
df_sales

  Category  Sales  Discount
0        A    200        20
1        A    250        25
2        B    400        40
3        B    420        50
4        C    150        15
5        C    180        18

In [23]:
# Group the data by 'Category' and calculate the average discount for each category.
df_sales.groupby('Category')['Discount'].mean()

Category
A    22.5
B    45.0
C    16.5
Name: Discount, dtype: float64

In [ ]:
data = {'Region': ['East', 'East', 'West', 'West', 'East', 'West'],
    'Product': ['A', 'B', 'A', 'B', 'A', 'A'],
    'Sales': [300, 200, 400, 250, 350, 500] }
df_products = pd.DataFrame(data)
df_products

  Region Product  Sales
0   East       A    300
1   East       B    200
2   West       A    400
3   West       B    250
4   East       A    350
5   West       A    500

In [11]:
# Group the data by both 'Region' and 'Product', and calculate the total sales for each group.
df_products.groupby(['Region', 'Product'])['Sales'].sum()

Region  Product
East    A          650
        B          200
West    A          900
        B          250
Name: Sales, dtype: int64

In [ ]:
data = {'City': ['Lahore', 'Lahore', 'Karachi', 'Karachi', 'Lahore', 'Islamabad'],
    'Customer': ['A', 'B', 'C', 'D', 'E', 'F'],
    'OrderID': [101, 102, 103, 104, 105, 106] }
df_orders = pd.DataFrame(data)
df_orders

        City Customer  OrderID
0     Lahore        A      101
1     Lahore        B      102
2    Karachi        C      103
3    Karachi        D      104
4     Lahore        E      105
5  Islamabad        F      106

In [ ]:
# Group the data by 'City' and count how many customers are in each city.
df_orders.groupby('City')['Customer'].count()

City
Islamabad    1
Karachi      2
Lahore       3
Name: Customer, dtype: int64

In [ ]:
data = {'Category': ['X', 'X', 'Y', 'Y', 'Z', 'Z'],
    'Sales': [100, 150, 200, 250, 300, 350],'Profit': [10, 15, 20, 25, 30, 35]}
df_profit = pd.DataFrame(data)
df_profit

  Category  Sales  Profit
0        X    100      10
1        X    150      15
2        Y    200      20
3        Y    250      25
4        Z    300      30
5        Z    350      35

In [ ]:
# Group the data by 'Category' and calculate both: Total Sales & Average Profit
df_profit.groupby('Category').agg({'Sales':'sum', 'Profit': 'mean'})

          Sales  Profit
Category
X           250    12.5
Y           450    22.5
Z           650    32.5